---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SystemsFailures.SelectedElementsArePartOfOtherSystem
source: html/21a51967-222d-a20b-195a-ccc25b0d2c8a.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SystemsFailures.SelectedElementsArePartOfOtherSystem Property

You have selected elements that are already part of other System. They will be removed from the original Systems and added to this one.

## Syntax (C#)
```csharp
public static FailureDefinitionId SelectedElementsArePartOfOtherSystem { get; }
```